In [1]:
import pandas as pd

df = pd.read_csv("employee_salary_dataset.csv")

display(df.head())

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
0,1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416
1,2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064
3,4,Employee_4,Operations,8,PhD,44,Male,Delhi,95091
4,5,Employee_5,Operations,15,Master,36,Female,Delhi,132450

In [3]:
df.aggregate({
    "Monthly_Salary": ["min", "max", "mean"]
})

      Monthly_Salary
min          28420.0
max         149123.0
mean         82288.8

In [9]:
dept_salary = df.groupby("Department").aggregate({"Monthly_Salary": ["min", "max", "mean"]})
display(dept_salary)

           Monthly_Salary
                      min     max          mean
Department
Finance             28420  118179  67261.900000
HR                  43589  134616  82945.142857
IT                  30600  130983  76520.500000
Marketing           30895  141381  96430.846154
Operations          31893  149123  84239.900000

In [15]:
import numpy as np

scaling = df.copy()
mean_age = np.mean(scaling['Age'])
sd_age = np.std(scaling['Age'])
scaling['standardized_age'] = (scaling['Age'] - mean_target) / (sd_target)

mean_salary = np.mean(scaling['Monthly_Salary'])
sd_salary = np.std(scaling['Monthly_Salary'])
scaling['standardized_salary'] = (scaling['Monthly_Salary'] - mean_target) / (sd_target)
display(scaling)

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary,standardized_age,standardized_salary
0,1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416,1.158987,9749.521536
1,2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271,-1.292043,8336.239626
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064,0.983914,6042.162264
3,4,Employee_4,Operations,8,PhD,44,Male,Delhi,95091,0.371156,8320.482999
4,5,Employee_5,Operations,15,Master,36,Female,Delhi,132450,-0.329138,11590.770944
5,6,Employee_6,Finance,3,High School,50,Male,Mumbai,65818,0.896377,5758.017756
6,7,Employee_7,IT,14,PhD,57,Male,Mumbai,70525,1.509135,6170.053553
7,8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830,-0.504212,3920.795041
8,9,Employee_9,IT,4,Bachelor,53,Male,Hyderabad,42429,1.158987,3710.619144
9,10,Employee_10,Operations,18,High School,28,Male,Mumbai,31893,-1.029433,2788.331240
10,11,Employee_11,Marketing,8,PhD,43,Male,Delhi,141381,0.283619,12372.562257
11,12,Employee_12,IT,4,Master,49,Female,Hyderabad,104909,0.808840,9179.919468
12,13,Employee_13,Operations,2,Master,23,Female,Hyderabad,72333,-1.467117,6328.320118
13,14,Employee_14,Finance,6,Bachelor,27,Male,Delhi,28436,-1.116970,2485.716464
14,15,Employee_15,Marketing,10,PhD,49,Female,Mumbai,99290,0.808840,8688.050093
15,16,Employee_16,Finance,4,High School,49,Female,Delhi,101213,0.808840,8856.383393
16,17,Employee_17,Marketing,18,Master,41,Female,Hyderabad,30895,0.108546,2700.969497
17,18,Employee_18,Operations,12,PhD,51,Female,Chennai,44738,0.983914,3912.741654
18,19,Employee_19,HR,2,PhD,32,Male,Chennai,55746,-0.679286,4876.346935
19,20,Employee_20,Marketing,10,Bachelor,49,Male,Bangalore,74377,0.808840,6507.245372
20,21,Employee_21,Finance,4,Master,46,Female,Delhi,73404,0.546230,6422.072049
21,22,Employee_22,Operations,14,Master,54,Female,Delhi,79045,1.246524,6915.867234
22,23,Employee_23,Marketing,16,High School,22,Male,Bangalore,122888,-1.554654,10753.743900
23,24,Employee_24,HR,15,Master,48,Male,Bangalore,64790,0.721303,5668.029908
24,25,Employee_25,HR,8,High School,34,Female,Bangalore,132455,-0.504212,11591.208628
25,26,Employee_26,IT,14,Master,24,Male,Hyderabad,30600,-1.379580,2675.146136
26,27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660,-1.116970,10471.175055
27,28,Employee_28,Finance,16,Master,29,Female,Hyderabad,118179,-0.941896,10341.533029
28,29,Employee_29,Marketing,13,High School,48,Male,Bangalore,65764,0.721303,5753.290768
29,30,Employee_30,Marketing,18,High School,30,Male,Delhi,99543,-0.854359,8710.196908
30,31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714,1.246524,6186.598012
31,32,Employee_32,Marketing,13,Master,45,Female,Hyderabad,81835,0.458693,7160.094953
32,33,Employee_33,Marketing,9,Master,36,Male,Bangalore,127946,-0.329138,11196.505121
33,34,Employee_34,HR,15,Bachelor,53,Female,Delhi,134616,1.158987,11780.375690
34,35,Employee_35,IT,13,Master,53,Male,Bangalore,130983,1.158987,11462.354434
35,36,Employee_36,Operations,1,Master,45,Female,Delhi,98744,0.458693,8640.254991
36,37,Employee_37,IT,7,High School,33,Male,Chennai,81491,-0.591749,7129.982288
37,38,Employee_38,Operations,9,Master,23,Male,Mumbai,149123,-1.467117,13050.272294
38,39,Employee_39,HR,1,Master,24,Male,Mumbai,43589,-1.379580,3812.161851
39,40,Employee_40,Finance,12,Bachelor,38,Female,Mumbai,68484,-0.154065,5991.390910
40,41,Employee_41,Marketing,8,Bachelor,23,Female,Bangalore,107989,-1.467117,9449.532864
41,42,Employee_42,HR,11,PhD,23,Male,Chennai,61212,-1.467117,5354.823177
42,43,Employee_43,Marketing,19,High School,49,Female,Delhi,68525,0.808840,5994.979919
43,44,Employee_44,Finance,17,Master,44,Male,Hyderabad,72202,0.371156,6316.852795
44,45,Employee_45,Finance,8,Master,53,Male,Delhi,57635,1.158987,5041.703982
45,46,Employee_46,HR,3,PhD,54,Female,Hyderabad,88208,1.246524,7717.967088
46,47,Employee_47,Finance,3,Master,22,Female,Delhi,58828,-1.554654,5146.135405
47,48,Employee_48,Operations,1,High School,40,Male,Chennai,43711,0.021009,3822.841343
48,49,Employee_49,Finance,5,PhD,23,Female,Hyderabad,28420,-1.467117,2484.315875
49,50,Employee_50,Marketing,10,High School,47,Female,Bangalore,121752,0.633767,10654.302076